sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
							HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
							HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN);

							aewin_dbg("\n\rSet Time: %2d:%2d:%2d",sTime.Hours ,sTime.Minutes, sTime.Seconds);
							aewin_dbg("\n\rSet Date: 20%2d_%2d_%2d  Weekday:%d",sDate.Year ,sDate.Month, sDate.Date ,sDate.WeekDay);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_Sys_InVOLT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							evt_vol = osMessageGet(ADC_VOLT_QHandle,osWaitForever);
							xFer[2] = Subcmd_Get_Sys_InVOLT;
							xFer[3] = current_IgEvent[NUM_in_sys_volt];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD22_LEN;

							aewin_dbg("\n\rGet system input voltage: %2d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_Sys_InVOLT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD23_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD23_LEN)])) break;
							current_IgEvent[NUM_in_sys_volt]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet  system input voltage: %2d", current_IgEvent[NUM_in_sys_volt]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_RebootSrc:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_RebootSrc;
							xFer[3] = current_IgEvent[NUM_reboot_source];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD26_LEN;

							aewin_dbg("\n\rGet reboot source: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_RebootSrc:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD27_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD27_LEN)])) break;
							current_IgEvent[NUM_reboot_source]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet reboot source: %d", current_IgEvent[NUM_reboot_source]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_BootMode:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_BootMode;
							xFer[3] = current_IgEvent[NUM_boot_mode];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD28_LEN;

							aewin_dbg("\n\rGet boot mode: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_BootMode:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD29_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD29_LEN)])) break;
							current_IgEvent[NUM_boot_mode]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet boot mode: %d", current_IgEvent[NUM_boot_mode]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_WWAN_WKStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_WWAN_WKStat;
							xFer[3] = current_IgEvent[NUM_WWAN_wakeup];
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD30_LEN;

							aewin_dbg("\n\rGet WWAN wake up status: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_WWAN_WKStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD31_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD31_LEN)])) break;
							current_IgEvent[NUM_WWAN_wakeup]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet WWAN wake up status: %d", current_IgEvent[NUM_WWAN_wakeup]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_WWAN_Stat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_WWAN_Stat;
							xFer[3] = current_IgEvent[NUM_WWAN_status];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD32_LEN;

							aewin_dbg("\n\rGet WWAN status: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_WWAN_Stat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD33_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD33_LEN)])) break;
							current_IgEvent[NUM_WWAN_status]=recv1[5];

							if(current_IgEvent[NUM_WWAN_status] == 1)
							{
								wwan_command = 1;
							}
							else if(current_IgEvent[NUM_WWAN_status] == 0)
							{
								wwan_command = 2;
							}
							flag_flashWrite = 1;

							aewin_dbg("\n\rSet WWAN status: %d", current_IgEvent[NUM_WWAN_status]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DigiIn:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DigiIn;
							//xFer[3] = ((sva_gpi.ig_sw) || (sva_gpi.pwr_btn<<1) || (sva_gpi.sys_pwron<<2));
							xFer[3] = sva_gpi.ebtn_in;

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD32_LEN;

							aewin_dbg("\n\rGet GPIO digital input : %x", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DigiOut:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DigiOut;
							xFer[3] = sva_gpo.ebtn_out;

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD36_LEN;

							aewin_dbg("\n\rGet GPIO digital output : %x", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DigiOut:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD37_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD37_LEN)])) break;
							sva_gpo.ebtn_out = (recv1[5] & 0x01);
							HAL_GPIO_WritePin(GPIOC, EBTN_OUT_Pin, (recv1[5] & 0x01));

