sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
							aewin_dbg("\n\rSet GPIO digital output : %x", sva_gpo.ebtn_out);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_SIM_Mode:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_SIM_Mode;
							xFer[3] = current_IgEvent[NUM_sim_card_mode];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD3A_LEN;

							aewin_dbg("\n\rGet SIM card select: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_SIM_Mode:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD3B_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD3B_LEN)])) break;
							current_IgEvent[NUM_sim_card_mode]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet SIM card select: %d", current_IgEvent[NUM_sim_card_mode]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_WIFI_OnOff:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_WIFI_OnOff;
							xFer[3] = current_IgEvent[NUM_wifi_status];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD40_LEN;

							aewin_dbg("\n\rGet WIFI status: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_WIFI_OnOff:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD41_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD41_LEN)])) break;
							current_IgEvent[NUM_wifi_status]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet WIFI status: %d", current_IgEvent[NUM_wifi_status]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_LAN_WKStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_LAN_WKStat;
							xFer[3] = current_IgEvent[NUM_LAN_wakeup];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD44_LEN;

							aewin_dbg("\n\rGet LAN wake up enable/disable: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_LAN_WKStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD45_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD45_LEN)])) break;
							current_IgEvent[NUM_LAN_wakeup]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet LAN wake up enable/disable: %d", current_IgEvent[NUM_LAN_wakeup]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOffStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DelayOffStat;
							xFer[3] = current_IgEvent[NUM_delay_off_setting];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD50_LEN;

							aewin_dbg("\n\rGet delay off enable/disable: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DelayOffStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD51_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD51_LEN)])) break;
							current_IgEvent[NUM_delay_off_setting]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet delay off enable/disable: %d", current_IgEvent[NUM_delay_off_setting]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOnStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DelayOnStat;
							xFer[3] = current_IgEvent[NUM_delay_on_setting];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD52_LEN;

							aewin_dbg("\n\rGet delay on enable/disable: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DelayOnStat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD53_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD53_LEN)])) break;
							current_IgEvent[NUM_delay_on_setting]=recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet delay on enable/disable: %d", current_IgEvent[NUM_delay_on_setting]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOffTime:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DelayOffTime;
							//xFer[3] = current_IgEvent[NUM_power_off_time];
							xFer[3] = current_IgEvent[NUM_pwroff_delay];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD54_LEN;

							aewin_dbg("\n\rGet delay time of power off: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DelayOffTime:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD55_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD55_LEN)])) break;
							//current_IgEvent[NUM_power_off_time]=recv1[5];
							current_IgEvent[NUM_pwroff_delay] = recv1[5];

							countdown_timer.poweroff_delay = current_IgEvent[NUM_pwroff_delay];
							flag_flashWrite = 1;

							aewin_dbg("\n\rSet delay time of power off: %d", current_IgEvent[NUM_pwroff_delay]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOnTime:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_DelayOnTime;
							//xFer[3] = current_IgEvent[NUM_power_on_time];
							xFer[3] = current_IgEvent[NUM_pwron_delay];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD56_LEN;

