sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
							aewin_dbg("\n\rGet delay time of power on: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DelayOnTime:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD57_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD57_LEN)])) break;
							//current_IgEvent[NUM_power_on_time]=recv1[5];
							current_IgEvent[NUM_pwron_delay] = recv1[5];

							countdown_timer.poweron_delay = current_IgEvent[NUM_pwron_delay];
							flag_flashWrite = 1;

							aewin_dbg("\n\rSet delay time of power on: %d", current_IgEvent[NUM_pwron_delay]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_ADC:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							evt_vol = osMessageGet(ADC_VOLT_QHandle,osWaitForever);
							evt_temp = osMessageGet(ADC_TEMP_QHandle, osWaitForever);
							xFer[2] = Subcmd_Get_ADC;
							xFer[3] = adc_voltageConversion_float(evt_vol.value.v);
							xFer[4] = adc_voltageConversion_int(evt_vol.value.v);
							xFer[5] = adc_tempConversion_float(evt_temp.value.v);
							xFer[6] = adc_tempConversion_int(evt_temp.value.v);

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD70_LEN;

							aewin_dbg("\n\rGet system input voltage: %2d.%2d", xFer[4], xFer[3]);
							aewin_dbg("\n\rGet system input temperature: %2d.%2d", xFer[6], xFer[5]);
							aewin_dbg("\n\rGet MCU temperature: %2d", xFer[4]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_GPS:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							evt_lat = osMessageGet(UART2_LAT_QHandle,osWaitForever);
							evt_long = osMessageGet(UART2_LONG_QHandle,osWaitForever);
							xFer[2] = Subcmd_Get_GPS;
							xFer[3] = (evt_lat.value.v)/10000000;
							xFer[4] = ((evt_lat.value.v)%10000000)/100000;
							xFer[5] = (((evt_lat.value.v)%10000000)%100000)*60/100000;
							xFer[6] = (evt_long.value.v)/10000000;
							xFer[7] = ((evt_long.value.v)%10000000)/100000;
							xFer[8] = (((evt_long.value.v)%10000000)%100000)*60/100000;

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD80_LEN;

							aewin_dbg("\n\rPrint GPS data: %u, %u", evt_lat.value.v, evt_long.value.v);
							aewin_dbg("\n\rPrint GPS data (compute result): %d %d %d, %d %d %d", (evt_lat.value.v)/10000000, ((evt_lat.value.v)%10000000)*60/10000000, ( (((evt_lat.value.v)%10000000)*60) % 10000000)*60/10000000,
									(evt_long.value.v)/10000000, ((evt_long.value.v)%10000000)*60/10000000, ( (((evt_long.value.v)%10000000)*60) % 10000000)*60/10000000);
							aewin_dbg("\n\rGet GPS data: %d %d %d, %d %d %d", xFer[3], xFer[4], xFer[5], xFer[6], xFer[7], xFer[8]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_Gsensor:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							evt_xaxis = osMessageGet(I2C1_XAXIS_QHandle,osWaitForever);
							evt_yaxis = osMessageGet(I2C1_YAXIS_QHandle,osWaitForever);
							evt_zaxis = osMessageGet(I2C1_ZAXIS_QHandle,osWaitForever);
							xFer[2] = Subcmd_Get_Gsensor;
							//if (evt_xaxis.status == osEventMessage)
							{
								xFer[3] = ((evt_xaxis.value.v)>>8);
								xFer[4] = ((evt_xaxis.value.v) & 0x00FF);

								xFer[5] = ((evt_yaxis.value.v)>>8);
								xFer[6] = ((evt_yaxis.value.v) & 0x00FF);

								xFer[7] = ((evt_zaxis.value.v)>>8);
								xFer[8] = ((evt_zaxis.value.v) & 0x00FF);
							}
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD90_LEN;

							aewin_dbg("\n\rGet G-sensor data: %x %x %x %x", xFer[3], xFer[4], xFer[5], xFer[6], xFer[7], xFer[8]);
							break;

						//-----------------------------------------------------
						case Subcmd_OS_Shutdown:
							break;

						//-----------------------------------------------------
						default:
							break;
					}
					break;

				//-----------------------------------------------------
				case M_CMD_IG_SETTING:
					switch(recv1[CMD_SCMD_POS]){
						case Subcmd_IG_Get_OnOff:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_IG_Get_OnOff;
							//if(current_IgEvent[NUM_ig_states] == IG_Start_Up)
							if(ig_var.ig_states == IG_Start_Up)
							{
								xFer[3] = 0x01;
							}
							else
							{
								xFer[3] = 0x00;
							}
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD10_LEN;

							aewin_dbg("\n\rGet ignition on/off status: %x", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_LowBat_Data:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_LowBat_Data;
							xFer[3] = current_IgEvent[NUM_12V_startup];
							xFer[4] = current_IgEvent[NUM_12V_shutdown];
							xFer[5] = current_IgEvent[NUM_24V_startup];
							xFer[6] = current_IgEvent[NUM_24V_shutdown];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD14_LEN;

							aewin_dbg("\n\rGet low battery data: %x %x %x %x", xFer[3], xFer[4], xFer[5], xFer[6]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_LowBat_Data:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD15_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD15_LEN)])) break;
							current_IgEvent[NUM_12V_startup] = recv1[5];
							current_IgEvent[NUM_12V_shutdown] = recv1[6];
							current_IgEvent[NUM_24V_startup] = recv1[7];
							current_IgEvent[NUM_24V_shutdown] = recv1[8];

							flag_flashWrite = 1;

							aewin_dbg("\n\rGet low battery data: %x %x %x %x", recv1[5], recv1[6], recv1[7], recv1[8]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_InVol_Limit:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_InVol_Limit;
							xFer[3] = current_IgEvent[NUM_InVol_limit_min];
							xFer[4] = current_IgEvent[NUM_InVol_limit_max];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD16_LEN;

							aewin_dbg("\n\rGet input voltage limit: %d V ~ %d V", xFer[3], xFer[4]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_InVol_Limit:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD17_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD17_LEN)])) break;
							current_IgEvent[NUM_InVol_limit_min] = recv1[5];
							current_IgEvent[NUM_InVol_limit_max] = recv1[6];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet input voltage limit: %d V ~ %d V", current_IgEvent[NUM_InVol_limit_min], current_IgEvent[NUM_InVol_limit_max]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_PwrOn_DelayT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_PwrOn_DelayT;
							//xFer[3] = current_IgEvent[NUM_power_on_time];
							//xFer[4] = current_IgEvent[NUM_power_off_time];
							xFer[3] = current_IgEvent[NUM_pwron_delay];
							xFer[4] = current_IgEvent[NUM_pwroff_delay];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD18_LEN;

