sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
							aewin_dbg("\n\rGet power delay time. power on: %d, power off: %d", xFer[3], xFer[4]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_PwrOn_DelayT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD19_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD19_LEN)])) break;
							//current_IgEvent[NUM_power_on_time] = recv1[5];
							//current_IgEvent[NUM_power_off_time] = recv1[6];
							current_IgEvent[NUM_pwron_delay] = recv1[5];
							current_IgEvent[NUM_pwroff_delay] = recv1[6];

							countdown_timer.poweron_delay = current_IgEvent[NUM_pwron_delay];
							countdown_timer.poweroff_delay = current_IgEvent[NUM_pwroff_delay];
							flag_flashWrite = 1;

							aewin_dbg("\n\rSet power delay time. power on: %d, power off: %d", current_IgEvent[NUM_pwron_delay], current_IgEvent[NUM_pwroff_delay]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_Alarm_Stat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_Alarm_Stat;
							xFer[3] = current_IgEvent[NUM_alarm_status];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD20_LEN;

							aewin_dbg("\n\rGet alarm status: %x", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_Alarm_Stat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD21_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD21_LEN)])) break;
							current_IgEvent[NUM_alarm_status] = recv1[5];

							flag_flashWrite = 1;
							//HAL_RTC_DeactivateAlarm(&hrtc, RTC_ALARM_A);

							aewin_dbg("\n\rSet alarm status: %d", current_IgEvent[NUM_alarm_status]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_RTC_LocalT:
							//0x10 0x20?
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
							HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
							xFer[2] = Subcmd_Get_RTC_LocalT;
							//xFer[3] = sDate.Year; 	  // Year low byte.
							//xFer[4] = 20; 			  // Year high byte.
							//xFer[5] = sDate.Month;	  // Month.
							//xFer[6] = sDate.Date;		// Date.
							xFer[3] = sTime.Hours;		// Hours.
							xFer[4] = sTime.Minutes;	// Minutes.
							xFer[5] = sTime.Seconds;	// Seconds.

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD22_LEN;

							aewin_dbg("\n\rGet RTC local time: %2d:%2d:%2d",sTime.Hours ,sTime.Minutes, sTime.Seconds);
							//aewin_dbg("\n\rGet Date: 20%2d_%2d_%2d  Weekday:%d",sDate.Year ,sDate.Month, sDate.Date ,sDate.WeekDay);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_RTC_LocalT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD23_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD23_LEN)])) break;
							sTime.Hours = recv1[5];		// Hours.
							sTime.Minutes = recv1[6];	// Minutes.
							sTime.Seconds = recv1[7];	// Seconds.
							HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);

							aewin_dbg("\n\rSet RTC local time: %2d:%2d:%2d", sTime.Hours, sTime.Minutes, sTime.Seconds);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_RTC_AlarmT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_RTC_AlarmT;
							//xFer[3] = current_IgEvent[NUM_RTC_AlarmT_hour];
							//xFer[4] = current_IgEvent[NUM_RTC_AlarmT_min];
							//xFer[5] = current_IgEvent[NUM_RTC_AlarmT_sec];
							if(HAL_RTC_GetAlarm(&hrtc, &sAlarm, RTC_ALARM_A, RTC_FORMAT_BIN) != HAL_OK)
							{
								//Error_Handler();
							}

							xFer[3] = sAlarm.AlarmTime.Hours;
							xFer[4] = sAlarm.AlarmTime.Minutes;
							xFer[5] = sAlarm.AlarmTime.Seconds;

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD24_LEN;

							aewin_dbg("\n\rGet RTC alarm time: %d : %d : %d", xFer[3],xFer[4], xFer[5]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_RTC_AlarmT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD25_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD25_LEN)])) break;
							current_IgEvent[NUM_RTC_AlarmT_hour] = recv1[5];	// Hours
							current_IgEvent[NUM_RTC_AlarmT_min] = recv1[6];	    // Minutes
							current_IgEvent[NUM_RTC_AlarmT_sec] = recv1[7];	    // Seconds

							sAlarm.AlarmTime.Hours = recv1[5];
							sAlarm.AlarmTime.Minutes = recv1[6];
							sAlarm.AlarmTime.Seconds = recv1[7];
							sAlarm.Alarm = RTC_ALARM_A;

							if(HAL_RTC_SetAlarm_IT(&hrtc,&sAlarm,RTC_FORMAT_BIN) != HAL_OK)
							  {
								Error_Handler();
							  }

							aewin_dbg("\n\rSet RTC alarm time: %d : %d : %d", current_IgEvent[NUM_RTC_AlarmT_hour], current_IgEvent[NUM_RTC_AlarmT_min], current_IgEvent[NUM_RTC_AlarmT_sec]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_RTC_WakeT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_RTC_WakeT;
							xFer[3] = current_IgEvent[NUM_RTC_WakeT_hour];
							xFer[4] = current_IgEvent[NUM_RTC_WakeT_min];
							xFer[5] = current_IgEvent[NUM_RTC_WakeT_sec];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD26_LEN;

							aewin_dbg("\n\rGet RTC wake time: %d : %d : %d", xFer[3],xFer[4], xFer[5]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_RTC_WakeT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD27_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD27_LEN)])) break;
							current_IgEvent[NUM_RTC_WakeT_hour] = recv1[5];	 // Hours.
							current_IgEvent[NUM_RTC_WakeT_min] = recv1[6];	 // Minutes.
							current_IgEvent[NUM_RTC_WakeT_sec] = recv1[7];	 // Seconds.

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet RTC wake time: %d : %d : %d", current_IgEvent[NUM_RTC_WakeT_hour], current_IgEvent[NUM_RTC_WakeT_min], current_IgEvent[NUM_RTC_WakeT_sec]);
							break;

						//-----------------------------------------------------
						case Subcmd_Get_Host_WTGT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_Host_WTGT;
							xFer[3] = current_IgEvent[NUM_wtdog_default];

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD40_LEN;

							aewin_dbg("\n\rGet host WDT time: %d", xFer[3]);
							break;

						//-----------------------------------------------------
						case Subcmd_Set_Host_WTGT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD41_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD41_LEN)])) break;
							current_IgEvent[NUM_wtdog_default] = recv1[5];

							flag_flashWrite = 1;

							aewin_dbg("\n\rSet host WDT time: %d", flash_IgEvent[NUM_wtdog_default]);
							break;

						//-----------------------------------------------------
						default:
							break;
					}
					break;

				//-----------------------------------------------------
				case M_CMD_4G_SETTING:
					switch(recv1[CMD_SCMD_POS]){
						case Subcmd_TeleComm_Event:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
							HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
							xFer[2] = Subcmd_TeleComm_Event;
							xFer[3] = sDate.Year; 		// Year low byte.
							xFer[4] = 20; 				// Year high byte.
							xFer[5] = sDate.Month;		// Month.
							xFer[6] = sDate.Date;		// Date.
							xFer[7] = sTime.Hours;		// Hours.
							xFer[8] = sTime.Minutes;	// Minutes.
							xFer[9] = sTime.Seconds;	// Seconds.
							//xFer[10] = current_IgEvent[NUM_ig_states];	    // Ignition status.
							xFer[10] = ig_var.ig_states;
							xFer[11] = current_IgEvent[NUM_shutdown_delay];	// Ignition Shutdown Count.

							//if(current_IgEvent[NUM_ig_states] == IG_Start_Up)           //Ignition On/Off Status
							if(ig_var.ig_states == IG_Start_Up)
							{
								xFer[12] = 0x00;
							}
							else
							{
								xFer[12] = 0x01;
							}

							xFer[13] = ig_var.fail_count;                          // Restart Failed &  Retry Times
							xFer[14] = r280_module_state.normal_flight_states;     // 4G status
							xFer[15] = r280_module_state.register_3G_4G;           // 3G/4G register
							xFer[16] = r280_module_state.signal_strength;          // Signal strength indicator
							xFer[17] = r280_module_state.signal_channel;           // Signal strength channel#
							xFer[18] = r280_module_state.ip_add_0;                 // 4G IP address
							xFer[19] = r280_module_state.ip_add_1;                 // 4G IP address
							xFer[20] = r280_module_state.ip_add_2;                 // 4G IP address
							xFer[21] = r280_module_state.ip_add_3;                 // 4G IP address
							xFer[22] = r280_module_state.sim_card;                 // SIM Card Status
							xFer[23] = r280_module_state.ping_status;              // 4G Ping Status
							xFer[24] = r280_module_state.server_response_time_0;   // Customer Server Response Time byte0
							xFer[25] = r280_module_state.server_response_time_0;   // Customer Server Response Time byte1

							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE +  W4G_SCMD10_LEN;

							aewin_dbg("\n\rGet Telecommunication Event.");
							break;
						//-----------------------------------------------------
						default:
							break;
					}
					break;

				//-----------------------------------------------------
				case M_CMD_BL_SETTING:
					switch(recv1[CMD_SCMD_POS]){
						case Subcmd_Jump_BootLoader:
							aewin_dbg("\n\rJump to bootloader.");
							flag_jumpToBootloader = 1;
							//JumpToBootloader();
							break;

						default:
							break;
					}

					break;

				//-----------------------------------------------------
				default:
					break;

