sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
			}

			if(TRUE == send2host){
				xFer[MCU_ID_POS] = MCU_REPO_ID;
				switch(recv1[CMD_MCMD_POS]){
					//-----------------------------------------------------
					case M_CMD_MCU_SETTING:
						xFer[1] = M_CMD_MCU_SETTING;
						break;
					//-----------------------------------------------------
					case M_CMD_IG_SETTING:
						xFer[1] = M_CMD_IG_SETTING;
						break;
					//-----------------------------------------------------
					case M_CMD_4G_SETTING:
						xFer[1] = M_CMD_4G_SETTING;
						break;
				}

				xFer[xFer_len] = CMD_ETX_CODE; 		// ETX code.
				xFer[xFer_len + 1] = 0x00; 			// Check sum.
				xFer[xFer_len + 2] = CMD_EOT_CODE;	// EOT code.
				xFer_len += CMD_TAIL_SIZE;

				// Start to transmit to host.
				HAL_UART_Transmit_DMA(&huart1, xFer, xFer_len);
				osDelay(UART1_TX_DELAY);
				send2host = FALSE;
				xFer_len = 0;
			}

			flag_rx_finished = 0;
			memset(recv1, 0, CMD_MAX_LEN);
		}

		//taskEXIT_CRITICAL();
		osDelay(UART1_TASK_ENTRY_TIME);
	}

  /* USER CODE END usart1_entry */
}

/* usart2_entry function */
void usart2_entry(void const * argument)
{
  /* USER CODE BEGIN usart2_entry */
	uint8_t recv2[UART2_RX_LENGTH] = {0};

	uint32_t latitude = 0, longitude = 0;
	uint8_t latitude_index = 0, longitude_index = 0;
	uint8_t reg_index, ip_index, strength_index;
	uint8_t ip_counter;

	uint8_t string_OK[2] = {'O','K'};
	uint8_t string_Not[3] = {'N', 'o', 't'};
	uint8_t string_UUPING[7] = {'+', 'U', 'U', 'P', 'I', 'N', 'G'};
	uint8_t string_UUPINGER[9] = {'+', 'U', 'U', 'P', 'I', 'N', 'G', 'E', 'R'};

	uint8_t flag_reset_internet = 1;

	int i;

	osDelay(UART2_WAIT_READY);
	//----------------------------------------

	// GPS
	//----------------------------------------
	// Configures the data flow to and from a u-blox GPS receiver connected to the Wireless Module AT+UGPRF=1
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Config_GPS], sizeof(uart_Tx[ATCMD_Config_GPS])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	print_atCommand(recv2, uart2_msg_print_switch);
	memset(recv2, 0, UART2_RX_LENGTH);
	//----------------------------------------


	// Enable the NMEA $RMC messages AT+UGRMC=1
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Enable_RMC], sizeof(uart_Tx[ATCMD_Enable_RMC])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	print_atCommand(recv2, uart2_msg_print_switch);
	memset(recv2, 0, UART2_RX_LENGTH);
	//----------------------------------------


	// Enable GPS AT+UGPS=1,0
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Enable_GPS], sizeof(uart_Tx[ATCMD_Enable_GPS])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	print_atCommand(recv2, uart2_msg_print_switch);
	memset(recv2, 0, UART2_RX_LENGTH);
	//----------------------------------------


    /* Infinite loop */
    for(;;)
    {
		/*if(HAL_UART_Receive_DMA(&huart2, (uint8_t*)&recv2, 1) == HAL_OK){
			HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&recv2, 1);
		}*/


    	/*##-2- Start the transmission process #####################################*/
    	  /* While the UART in reception process, user can transmit data through
    	     "aTxBuffer" buffer */
    	#if 0
    	if(HAL_UART_Transmit(&huart2, "+CSQ: 2,5", 10, 5000)!= HAL_OK)
    	  {
    	    Error_Handler();
    	  }


    	  /*##-3- Put UART peripheral in reception process ###########################*/
    	  if(HAL_UART_Receive(&huart2, (uint8_t *)recv2, 10, 5000) != HAL_OK)
    	  {
    	    Error_Handler();
    	  }



    	  if(HAL_UART_Receive_IT(&huart2, (uint8_t*)&recv2, 10)!= HAL_OK)
    	{
    		Error_Handler();
    	}

    	while (UartReady != SET)
		  {
		  }
#endif


    	//if(wwan_command == 1)
    	// enable but in flight mode
    	if((current_IgEvent[NUM_WWAN_status] == 1) && (r280_module_state.normal_flight_states == 40))
    	{
    		// enable WWAN, normal mode
    		wwan_command = 0;
    		flag_reset_internet = 1;

    		// Normal mode AT+CFUN=1
			HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_En_airplane], sizeof(uart_Tx[ATCMD_En_airplane])-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
    	}
    	//else if(wwan_command == 2)
    	// disable but in enable mode
    	else if((current_IgEvent[NUM_WWAN_status] == 0) && (r280_module_state.normal_flight_states == 10))
    	{
    		// disable WWAN, airplane mode AT+CFUN=4
    		wwan_command = 0;

    		// Airplane mode
			HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Dis_airplane], sizeof(uart_Tx[ATCMD_Dis_airplane])-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
    	}
    	//----------------------------------------

    	// reset internal Internet
		//----------------------------------------
		if(flag_reset_internet == 1)
		{
			flag_reset_internet = 0;

			// ignore check status steps
			/*
			// Get 3G,4G status AT+COPS?
			HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_Reg], sizeof(uart_Tx[ATCMD_Check_Reg])-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			  {
				//Error_Handler();
			  }
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

