sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
		//aewin_dbg("SIM mode is %d (airplane mode is '4')\r\n",  (recv2[uart_findDataIndex(recv2,1)]-'0'));
		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// Get 3G,4G status AT+COPS?
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_Reg], sizeof(uart_Tx[ATCMD_Check_Reg])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		  {
			//Error_Handler();
		  }
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);

		reg_index = uart_findDataIndex(recv2,4);

		if(recv2[reg_index] == '7')                  //4G
		{
			r280_module_state.register_3G_4G = 7;
		}
		else if(recv2[reg_index] == '2')             //3G
		{
			r280_module_state.register_3G_4G = 2;
		}
		else if(recv2[reg_index] == '0')             //2G
		{
			r280_module_state.register_3G_4G = 0;
		}

		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// 4G signal strength AT+CSQ
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_Signal], sizeof(uart_Tx[ATCMD_Check_Signal])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		{
			//Error_Handler();
		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);

		r280_module_state.signal_strength = 0;
		strength_index = uart_findDataIndex(recv2, 1);

		if(strength_index != 0)
		{
			r280_module_state.signal_strength = (recv2[strength_index]-'0');
			if (recv2[strength_index+1] != ',')
			{
				r280_module_state.signal_strength = 10*r280_module_state.signal_strength + (recv2[strength_index+1]-'0');
			}
		}

		//aewin_dbg("signal_sterngth is %d\r\n", r280_module_state.signal_strength);
		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// 4G IP address at+cgdcont?
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_APNIP], sizeof(uart_Tx[ATCMD_Check_APNIP])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		{
			//Error_Handler();
		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);

		ip_index = uart_findDataIndex(recv2,4)+1;

		ip_counter = 0;
		r280_module_state.ip_add_0 = 0;
		r280_module_state.ip_add_1 = 0;
		r280_module_state.ip_add_2 = 0;
		r280_module_state.ip_add_3 = 0;

		for( i = ip_index ; i < uart_findDataIndex(recv2,5)-2 ; i++ )
		{
			if(recv2[i]!='.')
			{
				switch(ip_counter)
				{
					case 0:
						r280_module_state.ip_add_0 = r280_module_state.ip_add_0*10 + (recv2[i]-'0');
						break;

					case 1:
						r280_module_state.ip_add_1 = r280_module_state.ip_add_1*10 + (recv2[i]-'0');
						break;

					case 2:
						r280_module_state.ip_add_2 = r280_module_state.ip_add_2*10 + (recv2[i]-'0');
						break;

					case 3:
						r280_module_state.ip_add_3 = r280_module_state.ip_add_3*10 + (recv2[i]-'0');
						break;

					default:
						break;
				}
			}
			else
			{
				ip_counter++;
			}
		}

		//aewin_dbg("IP is %x.%x.%x.%x\r\n",  r280_module_state.ip_add_0, r280_module_state.ip_add_1, r280_module_state.ip_add_2, r280_module_state.ip_add_3);
		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// ping status AT+UPING="www.google.com"
		if(wwan_command == 0)
		{
			HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Ping_web], sizeof(uart_Tx[ATCMD_Ping_web])-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			  {
				//Error_Handler();
			  }
			osDelay(UART2_ATCMD_DELAY*10);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);


			// check ping status
			if((uart2_isFindString(recv2, string_UUPING, sizeof(string_UUPING)) == 1) && (uart2_isFindString(recv2, string_UUPINGER, sizeof(string_UUPINGER)) == 0))
			{
				r280_module_state.ping_status = 0; //OK
				memset(recv2, 0, UART2_RX_LENGTH);
			}
			else
			{
				r280_module_state.ping_status = 1; //ERROR
				memset(recv2, 0, UART2_RX_LENGTH);

				// ping failed, reset internal Internet
				flag_reset_internet = 1;
			}
		}

		//----------------------------------------


		// Write 4 characters, AT+USOWR=0,4,"Test"
		HAL_UART_Transmit(&huart2, "AT+USOWR=0,4,\"Test\"", sizeof("AT+USOWR=0,4,\"Test\"")-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		{
			//Error_Handler();
		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);

		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// Read 4 echoed characters, AT+USORD=0,4
		HAL_UART_Transmit(&huart2, "AT+USORD=0,4", sizeof("AT+USORD=0,4")-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		{
			//Error_Handler();
		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);

		print_atCommand(recv2, uart2_msg_print_switch);


		// check read status
		if(uart2_isFindString(recv2, string_OK, sizeof(string_OK)) == 1)
		{
			r280_module_state.ping_status = 0; //OK
		}
		else
		{
			r280_module_state.ping_status = 1; //ERROR

			// ping failed, reset internal Internet
			flag_reset_internet = 1;
		}

		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------

		osDelay(UART2_TASK_ENTRY_TIME);
    }
  /* USER CODE END usart2_entry */
}

/* usart3_entry function */
void usart3_entry(void const * argument)
{
  /* USER CODE BEGIN usart3_entry */
	uint8_t recv3[4] = {0};
	int temp;
	uint8_t *cml_head, *cml_limit, *cml_ptr = cml_array;
	HAL_StatusTypeDef u3_states = HAL_OK;
	cml_head = cml_limit = cml_ptr;
	uint8_t cnt = 0;
	/* Infinite loop */
	for(;;)
	{
#if (0)
		//recv3[0] = recv3[1] = recv3[2] = 0;
		osMutexWait(MUTEX_DebugHandle, osWaitForever);
		if(HAL_UART_Receive(&huart3, (uint8_t*)&recv3[0], 1, 1) == HAL_OK){
			if (HAL_UART_Receive(&huart3, (uint8_t*)&recv3[1], 1, 1) != HAL_OK){
				switch(recv3[0]){
					case '\0':
						break;
					//-----------------------------------------------------
					case '\r':
					case '\n':
						HAL_UART_Transmit(&huart3, SVA_1000_NL, sizeof(SVA_1000_NL) - 1, sizeof(SVA_1000_NL) - 1);
						*cml_limit = '\0';
						osMutexWait(MUTEX_CMD_PROCHandle, osWaitForever);
						memcpy(cml_proc, cml_array, (uint32_t)(cml_limit - cml_head + 1));
						osMutexRelease(MUTEX_CMD_PROCHandle);
						cml_ptr = cml_limit = cml_head;

						break;

					//-----------------------------------------------------
					/* Delete Key. */
					case 0x7E:

						break;
					//-----------------------------------------------------
					case 0x7F:
						recv3[0] = '\b';

					case '\b':
						if ((cml_ptr > cml_head) && (cml_limit > cml_head)){
							temp = cml_limit - cml_ptr;
							*(--cml_ptr) = 0;
							strncpy(cml_ptr, (cml_ptr + 1), temp);
							HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, 1);
							HAL_UART_Transmit(&huart3, cml_ptr, temp, temp);
							HAL_UART_Transmit(&huart3, " ", 1, 1);
							//HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, UART3_TIMEOUT);


