sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
		/** Get the ADC value of MCU temperature. */
		evt = osMessageGet(ADC_TEMP_QHandle, osWaitForever);
		if (evt.status == osEventMessage){
			adc_temp = evt.value.v;
			//aewin_dbg("\n\r");
			//aewin_dbg("\n\rGet ADC TEMP = %.1d.%.2d V", (((adc_temp & 0xfffU) * 330) / 409600), \
													  ((((adc_temp & 0xfffU) * 330) / 4096) % 100));
		}


		//switch(ig_event.IG_States){
		//switch(current_IgEvent[NUM_ig_states]){
		switch(ig_var.ig_states){
			case IG_Recovery:
				// Recovery all of IG states and parameters.
				//config_recovery();

				//recovery countdown_timer
				countdown_timer.poweron_delay    = current_IgEvent[NUM_pwron_delay];
				countdown_timer.startup_timeout  = current_IgEvent[NUM_startup_timeout];
				countdown_timer.shutdown_delay   = current_IgEvent[NUM_shutdown_delay];
				countdown_timer.shutdown_timeout = current_IgEvent[NUM_shutdown_timeout];
				countdown_timer.poweroff_delay   = current_IgEvent[NUM_pwroff_delay];

				ig_var.ig_states = IG_CloseUp;
				break;

			//-------------------------------------------------------------------------------------
			case IG_CloseUp:
				// Judge the IG switch states.
				if(sva_gpi.ig_sw == GPIO_PIN_SET){
					/* IG On process */

					// Switch on, go to enter IG_PowerOn_Delay state.
					ig_var.ig_states = IG_PowerOn_Delay;

					// Reset the "start up timeout"
					countdown_timer.startup_timeout = current_IgEvent[NUM_startup_timeout];
					aewin_dbg("\n\rIgnition ON! IG_CloseUp --> IG_PowerOn_Delay");
				}

				// Judge the power button states.
				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){

					// button pressed, go to enter IG_Wait_StartUp state.
					ig_var.ig_states = IG_Wait_StartUp;

					// Reset the "start up timeout timer"
					countdown_timer.startup_timeout = current_IgEvent[NUM_startup_timeout];
					aewin_dbg("\n\rPower button On! IG_CloseUp --> IG_Wait_StartUp");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_PowerOn_Delay:
				// Judge the IG switch states.
				if(sva_gpi.ig_sw == GPIO_PIN_SET){

					if(current_IgEvent[NUM_delay_on_setting] == 0)
					{
						countdown_timer.poweron_delay = 0;
					}

					if (0 == (countdown_timer.poweron_delay--)){

						// Power on delay countdown over, go to enter IG_Wait_StartUp state.
						ig_var.ig_states = IG_Wait_StartUp;

						// Reset the "power on delay timer"
						countdown_timer.poweron_delay = current_IgEvent[NUM_pwron_delay];
						aewin_dbg("\n\rPower on delay pass! IG_PowerOn_Delay --> IG_Wait_StartUp");
					}
					else
					{
						aewin_dbg("\n\rpwron_delay_countdown:%d",countdown_timer.poweron_delay);
					}
				}
				else{

					// IG switch off, back to IG_CloseUp state.
					ig_var.ig_states = IG_CloseUp;

					// Reset the "power on delay timer"
					countdown_timer.poweron_delay = current_IgEvent[NUM_pwron_delay];
					aewin_dbg("\n\rPower on delay failed! IG_PowerOn_Delay --> IG_CloseUp");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_Wait_StartUp:
				/* Power button has been (long) pressed. */
				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){

					ig_var.pwrbtn_pressed = TRUE;

					if(0 == (countdown_timer.pwroff_btn_cnt--)){

						// button has been long pressed, back to IG_Recovery
						ig_var.ig_states = IG_Recovery;

						// system off
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);

						// reset 4G module
						enable_4GModule();

						aewin_dbg("\n\rIG_Wait_StartUp failed! IG_Wait_StartUp --> IG_Recovery");
					}
				}


				// Power button has been (short) pressed.
				if(ig_var.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){

					ig_var.pwrbtn_pressed = FALSE;

					// Reset the "Power off button count timer"
					countdown_timer.pwroff_btn_cnt = current_IgEvent[NUM_pwroff_btn_cnt];
				}


				if(sva_gpi.ig_sw == GPIO_PIN_SET){
					// Switch still on

					if (0 == (countdown_timer.wait_startup_time--)){

						// Reset the "wait startup timer"
						countdown_timer.wait_startup_time = current_IgEvent[NUM_wait_startup_time];

						// system on
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_SET);

						// reset 4G module
						enable_4GModule();

						// Confirm the the DC2DC power and system power are available.
						while((sva_gpi.dc2dc_pwrok != GPIO_PIN_SET) || (sva_gpi.sys_pwron == GPIO_PIN_SET)){

							if(0 == (countdown_timer.pwrgood_chk_time--)){
								break;
							}
						}

						if(0 != countdown_timer.pwrgood_chk_time){

							// DC2DC power and system power are available, go to IG_Start_Up.
							ig_var.ig_states = IG_Start_Up;
							aewin_dbg("\n\rPower on delay ok! IG_Wait_StartUp --> IG_Start_Up");
						}
						else{

							// system off
							HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);

							// reset 4G module
							enable_4GModule();

							// DC2DC power and system power are unavailable, back to IG_CloseUp.
							ig_var.ig_states = IG_CloseUp;
							aewin_dbg("\n\rDE2DC Power on failed! IG_Wait_StartUp --> IG_CloseUp");
						}

						// Reset the "power good check timer"
						countdown_timer.pwrgood_chk_time = current_IgEvent[NUM_pwrgood_chk_time];
					}
				}
				else{

					// Switch off, back to IG_PowerOn_Delay.
					ig_var.ig_states = IG_PowerOn_Delay;

					// Reset the "wait startup timer"
					countdown_timer.wait_startup_time = current_IgEvent[NUM_wait_startup_time];
					aewin_dbg("\n\rIG_Wait_StartUp failed! IG_Wait_StartUp --> IG_PowerOn_Delay");
				}

				//check startup voltage
				if(check_highPower(adc_24v) == 0)
				{
					// startup voltage is not high enough, go to IG_Wait_Retry
					ig_var.ig_states = IG_Wait_Retry;
					ig_var.fail_count++;

					// system off
					HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);

					aewin_dbg("\n\rInput voltage is lower than %3.1f", 10 + current_IgEvent[NUM_12V_startup]*0.5);
					aewin_dbg("\n\rIG_Wait_StartUp failed! IG_Wait_StartUp --> IG_Wait_Retry");
				}
				break;

