sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
			//-------------------------------------------------------------------------------------
			case IG_Start_Up:

				if(countdown_timer.startup_timeout > 0){
					/* Lock ignition off to prevent that user shutdowns the OS. */
					countdown_timer.startup_timeout--;
					aewin_dbg("\n\rLock power on!");
				}
				else{
					if( sva_gpi.ig_sw ==  GPIO_PIN_RESET){

						// Switch off, back to IG_Shutdown_Delay.
						ig_var.ig_states = IG_Shutdown_Delay;
						aewin_dbg("\n\rIngition switch off! IG_Start_Up --> IG_Shutdown_Delay");
					}
				}

				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){

					ig_var.pwrbtn_pressed = TRUE;

					if(0 == (countdown_timer.pwroff_btn_cnt--)){

						// button has been long pressed, back to IG_Recovery.
						ig_var.ig_states = IG_Recovery;

						// system off
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);

						// reset 4G module
						enable_4GModule();
					}
				}


				if(ig_var.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){

					ig_var.pwrbtn_pressed = FALSE;

					// button was be pressed but now is not, back to IG_shutting_Down.
					ig_var.ig_states = IG_shutting_Down;

					// reset "power off button count timer"
					countdown_timer.pwroff_btn_cnt = current_IgEvent[NUM_pwroff_btn_cnt];
					aewin_dbg("\n\rPower button off! IG_Start_Up --> IG_shutting_Down");
				}

				if(check_lowPower(adc_24v) == 1)
				{
					// input voltage is too low, go to IG_LowPower_Delay.
					ig_var.ig_states = IG_LowPower_Delay;
					aewin_dbg("\n\rPower off delay failed! IG_Shutdown_Delay --> IG_LowPower_Delay");
				}

				if(sva_gpi.sw_shutdown == GPIO_PIN_RESET)
				{
					// startup voltage is not high enough, go to IG_Wait_Retry
					ig_var.ig_states = IG_Wait_Retry;

					// system off
					HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);

					// reset 4G module
					enable_4GModule();

					aewin_dbg("\n\rSystem shutdown! IG_Wait_StartUp --> IG_Wait_Retry");

				}

				break;

			//-------------------------------------------------------------------------------------
			case IG_Shutdown_Delay:

				if(sva_gpi.ig_sw == GPIO_PIN_RESET){

					if(current_IgEvent[NUM_delay_off_setting] == 0)
					{
						countdown_timer.poweroff_delay = 0;
					}


					if (0 == (countdown_timer.poweroff_delay--)){

						// Power off delay countdown over, go to enter IG_shutting_Down state.
						ig_var.ig_states = IG_shutting_Down;

						// Reset "power off delay timer"
						countdown_timer.poweroff_delay = current_IgEvent[NUM_pwroff_delay];
						aewin_dbg("\n\rPower off delay pass! IG_Shutdown_Delay --> IG_shutting_Down");
					}
					else
					{
						aewin_dbg("\n\rpwroff_delay_countdown:%d",countdown_timer.poweroff_delay);
					}
				}
				else{

					// Switch on, back to IG_Start_Up
					ig_var.ig_states = IG_Start_Up;

					// Reset "power off delay timer"
					countdown_timer.poweroff_delay = current_IgEvent[NUM_pwroff_delay];
					aewin_dbg("\n\rPower off delay failed! IG_Shutdown_Delay --> IG_Start_Up");
				}

				if(check_lowPower(adc_24v) == 1)
				{
					// input voltage is too low, go to IG_LowPower_Delay state.
					ig_var.ig_states = IG_LowPower_Delay;

					// Reset "power off delay timer"
					countdown_timer.poweroff_delay = current_IgEvent[NUM_pwroff_delay];
					aewin_dbg("\n\rPower off delay failed! IG_Shutdown_Delay --> IG_LowPower_Delay");
				}

				break;

			//-------------------------------------------------------------------------------------
			case IG_shutting_Down:

				if(sva_gpi.ig_sw == GPIO_PIN_RESET){

					if (0 == (countdown_timer.shutdown_delay--)){

						// switch off, go to IG_CloseUp state.
						ig_var.ig_states = IG_CloseUp;

						// system off
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);

						// reset 4G module
						enable_4GModule();

						// reset "shutdown delay timer"
						countdown_timer.shutdown_delay = current_IgEvent[NUM_shutdown_delay];
						aewin_dbg("\n\rShutdown delay pass! IG_shutting_Down --> IG_CloseUp");
					}
				}
				else{

					// system is not shutdown and switch is on, back to IG_Shutdown_Delay state.
					ig_var.ig_states = IG_Shutdown_Delay;

					// reset "shutdown delay timer"
					countdown_timer.shutdown_delay = current_IgEvent[NUM_shutdown_delay];
					aewin_dbg("\n\rShutdown delay failed! IG_shutting_Down --> IG_Shutdown_Delay");
				}



				break;

			//-------------------------------------------------------------------------------------
			case IG_LowPower_Delay:

				if (0 == (countdown_timer.lowpower_delay--)){

					// low power delay countdown over, go to IG_CloseUp state.
					ig_var.ig_states = IG_CloseUp;

					// system off
					HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);

					// reset 4G module
					enable_4GModule();

					// reset "lowpower delay timer"
					countdown_timer.lowpower_delay = current_IgEvent[NUM_lowpwr_dealy];
					aewin_dbg("\n\rLowPower delay pass! IG_LowPower_Delay --> IG_CloseUp");
				}
				else
				{
					//Unknown
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_Wait_Retry:
				if(sva_gpi.ig_sw == GPIO_PIN_RESET){
					ig_var.ig_states = IG_Recovery;
					aewin_dbg("\n\rRetry ignition! IG_Wait_Retry --> IG_Recovery");
				}
				else
				{
					//Unknown
				}
				break;

		}
    	osDelay(INGITION_TASK_ENTRY_TIME);
    }
  /* USER CODE END ignition_entry */
}

/* i2c1_entry function */
void i2c1_entry(void const * argument)
{
  /* USER CODE BEGIN i2c1_entry */

	sI2C1_DATA i2c1_data;
	/* Buffer used for reception */
	uint8_t ADXL345_RxBuffer[6];
	uint8_t ADXL345_DEVID[1];
	//uint8_t ASXL345_sensorSetting[1];
	uint8_t regptr[] = {I2C_ADXL345_CMD_DEV_ID, I2C_ADXL345_CMD_PWR_CTL, I2C_ADXL345_DATA_MEASURE, I2C_ADXL345_CMD_GPS_DATA};

	//read ADXL345 device ID (0xE5)
	//HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, &regptr[0], 1, 1000);
	//HAL_I2C_Master_Receive(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t *)ADXL345_DEVID, 1, 10000);

	//enable ADXL345 x,y,z-axis G-sensor
	//HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, &regptr[1], 2, 1000);

