sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
	//Check G-sensor setting
	//HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, &regptr[1], 1, 1000);
	//HAL_I2C_Master_Receive(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t *)ASXL345_sensorSetting, 1, 10000);

    /* Infinite loop */
	for(;;)
	{
		//HAL_SMBUS_Master_Transmit_IT(&hsmbus1, I2C_DEV_ADDRESS_ADXL345, &regptr, 1, SMBUS_AUTOEND_MODE);
		//HAL_Delay(10);
		//HAL_SMBUS_Master_Receive_IT(&hsmbus1, I2C_DEV_ADDRESS_ADXL345,  ADXL345_RxBuffer, 6, SMBUS_AUTOEND_MODE);

		//HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_SET);
		if((sva_gpi.dc2dc_pwrok == GPIO_PIN_SET) && (sva_gpi.sys_pwron == GPIO_PIN_SET)){
			//HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t*)regptr, sizeof(regptr), 1000);
			//HAL_I2C_Master_Receive(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t *)ADXL345_DEVID, 1, 10000);

			//read ADXL345 device ID (0xE5)
			HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, &regptr[0], 1, 1000);
			HAL_I2C_Master_Receive(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t *)ADXL345_DEVID, 1, 10000);

			//enable ADXL345 measure
			HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, &regptr[1], 2, 1000);

			HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, &regptr[3], 1, 1000);
			HAL_I2C_Master_Receive(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t *)ADXL345_RxBuffer, 6, 10000);

			i2c1_data.x_axis = ((ADXL345_RxBuffer[1]<<8)|(ADXL345_RxBuffer[0]));
			i2c1_data.y_axis = ((ADXL345_RxBuffer[3]<<8)|(ADXL345_RxBuffer[2]));
			i2c1_data.z_axis = ((ADXL345_RxBuffer[5]<<8)|(ADXL345_RxBuffer[4]));

			if( osMessagePut(I2C1_XAXIS_QHandle, i2c1_data.x_axis, osWaitForever) != osOK )
			{
				aewin_dbg("\n\rI2C1 G-sensor x-axis put Q failed. \r\n");
			}

			if( osMessagePut(I2C1_YAXIS_QHandle, i2c1_data.y_axis, osWaitForever) != osOK )
			{
				aewin_dbg("\n\rI2C1 G-sensor y-axis put Q failed. \r\n");
			}

			if( osMessagePut(I2C1_ZAXIS_QHandle, i2c1_data.z_axis, osWaitForever) != osOK )
			{
				aewin_dbg("\n\rI2C1 G-sensor put z-axis Q failed. \r\n");
			}
		}



#if 0
		/* While the I2C in reception process, user can transmit data through
			 "aTxBuffer" buffer */
		  /* Timeout is set to 10S */
		  while(HAL_I2C_Master_Transmit(&hi2c1, (uint16_t)0xE5, &regptr, 1, 10)!= HAL_OK)
		  {
			/* Error_Handler() function is called when Timeout error occurs.
			   When Acknowledge failure occurs (Slave don't acknowledge its address)
			   Master restarts communication */
			if (HAL_I2C_GetError(&hi2c1) != HAL_I2C_ERROR_AF)
			{
			  Error_Handler();
			}
		  }

		  while(HAL_I2C_Master_Receive(&hi2c1, (uint16_t)0xE5, (uint8_t *)ADXL345_RxBuffer, 6, 10000) != HAL_OK)
		  {
			  /* Error_Handler() function is called when Timeout error occurs.
				 When Acknowledge failure occurs (Slave don't acknowledge it's address)
				 Master restarts communication */
			  if (HAL_I2C_GetError(&hi2c1) != HAL_I2C_ERROR_AF)
			  {
				Error_Handler();
			  }
		   }


		  //if(HAL_I2C_Master_Receive_DMA(&I2cHandle, (uint16_t)I2C_DEV_ADDRESS_ADXL345, (uint8_t *)ADXL345_RxBuffer, BUFFER_SIZE_ADXL345) != HAL_OK)
		if(HAL_I2C_Mem_Read_DMA( &I2cHandle,  0xE5,  0x32, I2C_MEMADD_SIZE_8BIT,  (uint8_t *)ADXL345_RxBuffer,  6) != HAL_OK)
		{
		  /* Error_Handler() function is called when error occurs. */
		  Error_Handler();
		}

		/* Wait for the end of the transfer */
		while (HAL_I2C_GetState(&I2cHandle) != HAL_I2C_STATE_READY)
		{
		}

	#endif


		//aewin_dbg("\n\rI2C Task");
        osDelay(I2C1_TASK_ENTRY_TIME);
	}
  /* USER CODE END i2c1_entry */
}

/* adc_entry function */
void adc_entry(void const * argument)
{
  /* USER CODE BEGIN adc_entry */
    /* Variable containing ADC conversions results */
	sADC_DATA adc_data;

	/* Infinite loop */
	for(;;)
    {

        /* Start ADC conversion on regular group with transfer by DMA */
		if (HAL_ADC_Start_DMA(&hadc, (uint32_t *)&adc_data, ADC_DEVICE_NUM) != HAL_OK)
		{
			// ADC start failed.
			aewin_dbg("\n\rADC start up failed!");
		}
		// ADC initial and capture
		osDelay(ADC_CAP_TIME);

		// Get ADC value of battery voltage.
		if( osMessagePut(ADC_VOLT_QHandle, adc_data.pwr_24v, osWaitForever) != osOK )
		{
			aewin_dbg("\n\rADC_24V put Q failed. \r\n");
		}

		// Get ADC value of MUC temperature
		if( osMessagePut(ADC_TEMP_QHandle, adc_data.mcu_temp, osWaitForever) != osOK )
		{
			aewin_dbg("\n\rMCU-Temperature put Q failed. \r\n");
		}

		/* Stop ADC converting. */
		HAL_ADC_Stop_DMA(&hadc);
		// Let ADC converter take a break.
		osDelay(ADC_TASK_ENTRY_TIME);

    }
  /* USER CODE END adc_entry */
}

/* IWDG_entry function */
void IWDG_entry(void const * argument)
{
  /* USER CODE BEGIN IWDG_entry */
  /* Infinite loop */
  for(;;)
  {
	  /* Refresh IWDG */

	  // function test
	  //HAL_GPIO_WritePin(DEBUG_GPO_GPIO_Port, DEBUG_GPO_Pin, GPIO_PIN_SET);
	  //HAL_Delay(1);
	  //HAL_GPIO_WritePin(DEBUG_GPO_GPIO_Port, DEBUG_GPO_Pin, GPIO_PIN_RESET);

	  if(flag_jumpToBootloader == 1)
	  {
		  osThreadTerminate(USART1_TaskHandle);
		  osThreadTerminate(USART2_TaskHandle);
		  osThreadTerminate(USART3_TaskHandle);
		  osThreadTerminate(IGNITION_TaskHandle);
		  osThreadTerminate(I2C1_TaskHandle);
		  osThreadTerminate(ADC_TaskHandle);
		  osThreadTerminate(CMD_PROC_TaskHandle);
		  osThreadTerminate(GPIO_STATE_TaskHandle);
		  osThreadTerminate(SPI1_TaskHandle);
		  osThreadTerminate(CAN_TaskHandle);

		  osDelay(JUMP_BOOTLOADER_DELAY_TIME);

		  JumpToBootloader();
	  }

	  HAL_IWDG_Refresh(&hiwdg);
	  osDelay(IWDG_TASK_ENTRY_TIME);

  }
  /* USER CODE END IWDG_entry */
}

/* cmd_proc_entry function */
void cmd_proc_entry(void const * argument)
{
  /* USER CODE BEGIN cmd_proc_entry */
  /* Infinite loop */
  for(;;)
  {
	  HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	  HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);

	  HAL_RTC_GetAlarm(&hrtc, &sAlarm, RTC_ALARM_A, RTC_FORMAT_BIN);

	  //aewin_dbg("\n\rGet RTC alarm time: %d : %d : %d", sAlarm.AlarmTime.Hours,sAlarm.AlarmTime.Minutes, sAlarm.AlarmTime.Seconds);
	  //aewin_dbg("\n\rGet Time: %2d:%2d:%2d",sTime.Hours ,sTime.Minutes, sTime.Seconds);
	  //aewin_dbg("\n\r=============================",sTime.Hours ,sTime.Minutes, sTime.Seconds);
	  osDelay(1000);


