sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
		//Read
		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi1, (uint8_t*)aTxBuffer3, sizeof(aTxBuffer3), 5000);

		HAL_SPI_Receive(&hspi1, (uint8_t*)flash_RxBuffer, sizeof(flash_RxBuffer), 10000);
		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

	}
	else
	{
		for(loop_index = 0; loop_index < (NUM_total-SPI_FLASH_LEN_CMDADD); loop_index++)
		{
			flash_IgEvent[loop_index + SPI_FLASH_LEN_CMDADD] = flash_RxBuffer[loop_index];
		}
		flash_IgEvent[0] = SPI_FLASH_PROGRAM_PAGE;
		flash_IgEvent[1] = SPI_FLASH_ADD_Byte0;
		flash_IgEvent[2] = SPI_FLASH_ADD_Byte1;
		flash_IgEvent[3] = SPI_FLASH_ADD_Byte2;
	}


	//=========================================================

  /* Infinite loop */
  for(;;)
  {
	  if(flag_flashWrite == 1)
	  {
		  //write eeprom
		  write_setting_to_eeprom();

		  //write flash
		  //WREN
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)aTxBuffer0, sizeof(aTxBuffer0), 5000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

		  	//RDSR
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_rdsr, sizeof(cmd_rdsr), 5000);

		  	HAL_SPI_Receive(&hspi1, (uint8_t*)data_rdsr, 1, 5000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

		  	//Check WEL
		  	while((data_rdsr[0] & (1<<1)) == 0)
		  	{
		  		//WREN
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  		HAL_SPI_Transmit(&hspi1, (uint8_t*)aTxBuffer0, sizeof(aTxBuffer0), 5000);
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

		  		//RDSR
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  		HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_rdsr, sizeof(cmd_rdsr), 5000);

		  		HAL_SPI_Receive(&hspi1, (uint8_t*)data_rdsr, 1, 5000);
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);
		  	}

		  	//Erase
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)aTxBuffer1, sizeof(aTxBuffer1), 5000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);


		  	//Erase 0xC7
		  	//HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	//HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_erase, sizeof(cmd_erase), 5000);
		  	//HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

		  	//Check WIP
		  	while((data_rdsr[0] & (1<<0)) != 0)
		  	{
		  		//RDSR
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  		HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_rdsr, sizeof(cmd_rdsr), 5000);

		  		HAL_SPI_Receive(&hspi1, (uint8_t*)data_rdsr, 1, 5000);
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);
		  	}

		  	//WREN
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)aTxBuffer0, sizeof(aTxBuffer0), 5000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);


		  	//RDSR
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_rdsr, sizeof(cmd_rdsr), 5000);

		  	HAL_SPI_Receive(&hspi1, (uint8_t*)data_rdsr, 1, 5000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

		  	//Check WEL
		  	while((data_rdsr[0] & (1<<1)) == 0)
		  	{
		  		//WREN
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  		HAL_SPI_Transmit(&hspi1, (uint8_t*)aTxBuffer0, sizeof(aTxBuffer0), 5000);
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

		  		//RDSR
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  		HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_rdsr, sizeof(cmd_rdsr), 5000);

		  		HAL_SPI_Receive(&hspi1, (uint8_t*)data_rdsr, 1, 5000);
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);
		  	}

		  	//Program
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)flash_IgEvent, sizeof(flash_IgEvent), 5000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

		  	//RDSR
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_rdsr, sizeof(cmd_rdsr), 5000);

		  	HAL_SPI_Receive(&hspi1, (uint8_t*)data_rdsr, 1, 5000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

		  	//Check WIP
		  	while((data_rdsr[0] & (1<<0)) != 0)
		  	{
		  		//RDSR
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  		HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_rdsr, sizeof(cmd_rdsr), 5000);

		  		HAL_SPI_Receive(&hspi1, (uint8_t*)data_rdsr, 1, 5000);
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);
		  	}

		  	//RDSR
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_rdsr, sizeof(cmd_rdsr), 5000);

		  	HAL_SPI_Receive(&hspi1, (uint8_t*)data_rdsr, 1, 5000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

		  	//Check WEL
		  	/*
		  	while((data_rdsr[0] & (1<<1)) != 0)
		  	{
		  		//RDSR
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  		HAL_SPI_Transmit(&hspi1, (uint8_t*)cmd_rdsr, sizeof(cmd_rdsr), 5000);

		  		HAL_SPI_Receive(&hspi1, (uint8_t*)data_rdsr, 1, 5000);
		  		HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);
		  	}
		  	*/

		  	//Read
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)aTxBuffer3, sizeof(aTxBuffer3), 5000);

		  	HAL_SPI_Receive(&hspi1, (uint8_t*)flash_RxBuffer, sizeof(flash_RxBuffer), 10000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);


		    flag_flashWrite = 0;
	  }

	  osDelay(SPI1_TASK_ENTRY_TIME);
  }
  /* USER CODE END spi1_entry */
}

/* can_entry function */
void can_entry(void const * argument)
{
  /* USER CODE BEGIN can_entry */
	//uint8_t canTx[8] = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07};
	uint8_t ubKeyNumber = 0x0;
	CAN_FilterConfTypeDef  sFilterConfig;
	CanTxMsgTypeDef  TxMessage;
 	CanRxMsgTypeDef  RxMessage;

 	hcan.pTxMsg = &TxMessage;
 	hcan.pRxMsg = &RxMessage;


 	/*##-2- Configure the CAN Filter ###########################################*/
	  sFilterConfig.FilterNumber = 0;
	  sFilterConfig.FilterMode = CAN_FILTERMODE_IDMASK;
	  sFilterConfig.FilterScale = CAN_FILTERSCALE_32BIT;
	  sFilterConfig.FilterIdHigh = 0x0000;
	  sFilterConfig.FilterIdLow = 0x0000;
	  sFilterConfig.FilterMaskIdHigh = 0x0000;
	  sFilterConfig.FilterMaskIdLow = 0x0000;
	  sFilterConfig.FilterFIFOAssignment = 0;
	  sFilterConfig.FilterActivation = ENABLE;
	  sFilterConfig.BankNumber = 14;

	  if (HAL_CAN_ConfigFilter(&hcan, &sFilterConfig) != HAL_OK)
	  {
		/* Filter configuration Error */
		Error_Handler();
	  }

	  /*##-3- Configure Transmission process #####################################*/
	  hcan.pTxMsg->StdId = 0x321;
	  hcan.pTxMsg->ExtId = 0x01;
	  hcan.pTxMsg->RTR = CAN_RTR_DATA;
	  hcan.pTxMsg->IDE = CAN_ID_STD;
	  hcan.pTxMsg->DLC = 4;

	  //hcan.pTxMsg->Data[0] = 0xA5;
	  //hcan.pTxMsg->Data[1] = 0x63;


