sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
  /* Infinite loop */
  for(;;)
  {
	  /*##-2- Start the Reception process and enable reception interrupt #########*/
		if (HAL_CAN_Receive_IT(&hcan, CAN_FIFO0) != HAL_OK)
		{
			/* Reception Error */
			Error_Handler();
		}

	  /* Set the data to be transmitted */
			ubKeyNumber++;
			hcan.pTxMsg->Data[0] = ubKeyNumber;
			hcan.pTxMsg->Data[1] = 0x55;
			hcan.pTxMsg->Data[2] = 0xaa;
			hcan.pTxMsg->Data[3] = 0xaa;

	  /*##-3- Start the Transmission process ###############################*/
	  if (HAL_CAN_Transmit(&hcan, 10) != HAL_OK)
	  {
		/* Transmission Error */
		Error_Handler();
	  }

	  //HAL_CAN_Transmit_IT(&hcan);
	  //HAL_CAN_Receive(&hcan,  CAN_FIFO0, 1000);
	  osDelay(CAN_TASK_ENTRY_TIME);
  }
  /* USER CODE END can_entry */
}

/* USER CODE BEGIN Application */
#if (AEWIN_DBUG)
void aewin_dbg(char *fmt,...){
	osMutexWait(MUTEX_DebugHandle, osWaitForever);
	int i = 0;
	static va_list arg_ptr;
	va_start (arg_ptr, fmt);
	vsnprintf(dbg_buff, PRINT_BUFF, fmt, arg_ptr);
	while(i < (PRINT_BUFF - 1) && dbg_buff[i]){
		if (HAL_UART_Transmit_DMA(&huart3, (uint8_t*)&dbg_buff[i], 1) == HAL_OK){
			i++;
		}
	}
	va_end(arg_ptr);
	osMutexRelease(MUTEX_DebugHandle);
}
#endif

void HAL_RTC_AlarmAEventCallback(RTC_HandleTypeDef *handleRTC)
{
	uint8_t xFer[CMD_HEAD_SIZE + CMD_TAIL_SIZE + 1] = {0x91, 0xA0, 0x10, 0x01, 0x03, 0x00, 0x04};
	// RTC wakeup
	if(current_IgEvent[NUM_alarm_status] == 1)
	{
		HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_RESET);
		HAL_Delay(1);
		HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_SET);

		// Start to transmit to host.
		HAL_UART_Transmit_DMA(&huart1, xFer, CMD_HEAD_SIZE + CMD_TAIL_SIZE + 1);
		HAL_Delay(5);
	}
}



uint8_t adc_voltageConversion_int(uint32_t adc_value)
{
	// (((adc_24v & 0xfffU) * 330) / 409600) * 117 / 10
	//return ((((adc_value & 0xfffU) * 330) ) * 11700) / 1000 / 409600;
	return ((((adc_value & 0xfffU) * 330) ) * 117) / 1000 / 4096;
}

uint8_t adc_voltageConversion_float(uint32_t adc_value)
{
	// (((((adc_24v & 0xfffU) * 330) / 409600) * 117 / 10  * 100)% 100)
	return (((((adc_value & 0xfffU) * 330) ) * 11700) / 10 / 409600) % 100;
}

uint8_t adc_tempConversion_int(uint32_t adc_value)
{
	uint16_t mcu_adc, r_adc;
	double temp;
	mcu_adc = (((adc_value & 0xfffU) * 330) / 409600);

	// R = (10*MCU_ADC) / (3.3-MCU_ADC)
	r_adc = (100 * mcu_adc)/(33 - 10*mcu_adc);

	//r_adc = 10*(adc_value & 0xfffU)/(4096-(adc_value & 0xfffU))


	// 1/( log(r_adc/THERMISTOR_R25)/THERMISTOR_B_CONSTANT+1/(298.13) ) -273.13??;
	//return (100/( log(r_adc/THERMISTOR_R25)/THERMISTOR_B_CONSTANT + 100/(29813) ) -27313)/100;
	//return ((-1379)*(1*r_adc-10)+25000)/1000;
	return (158883840-26379*(adc_value & 0xfffU))/4096000;
}

uint8_t adc_tempConversion_float(uint32_t adc_value)
{
	uint16_t mcu_adc, r_adc, temp;
	mcu_adc = (((adc_value & 0xfffU) * 330) / 409600);

	// R = (10*MCU_ADC) / (3.3-MCU_ADC)
	r_adc = (100 * mcu_adc)/(33 - 10*mcu_adc);

	// 1/( log(r_adc/THERMISTOR_R25)/THERMISTOR_B_CONSTANT+1/(298.13) ) -273.13??;
	//return (100/( log(r_adc/THERMISTOR_R25)/THERMISTOR_B_CONSTANT+100/(29813) ) -27313) %100;
	//return (((-1379)*(1*r_adc-10)+25000)/10) % 100;
	return ((158883840-26379*(adc_value & 0xfffU))/40960)%100;
}





uint8_t uart_findDataIndex(uint8_t uart_msg[], uint8_t target_data)
{
	// target data is the target_comma
	// first data is regard as 0th comma

	uint16_t index, split_count;

	// find index
	split_count = 0;
	for(index = 0; index<UART2_RX_LENGTH; index++)
	{
		if(target_data == 1)
		{
			if(uart_msg[index] == ':')
			{
				return (index+2);
			}
		}
		else
		{
			if(uart_msg[index] == ',')
			{
				split_count++;
			}

			if(split_count == (target_data-1))
			{
				return (index+1);
			}
		}
	}

	// target not found
	return 0;
}

uint8_t uart2_isFindString(uint8_t uart_msg[], uint8_t target_string[], uint8_t length)
{
	uint16_t index, string_index, flag_find = 0;
	for(index = 0; index<UART2_RX_LENGTH; index++)
	{
		if(uart_msg[index] == target_string[0])
		{
			for(string_index = 1; string_index < length; string_index++)
			{
				if(uart_msg[index + string_index] != target_string[string_index])
				{
					flag_find = 0;
					break;
				}
				else
				{
					flag_find = 1;
				}
			}
			//break;
		}
	}
	return flag_find;
}

void enable_4GModule(void)
{
	//A1
	HAL_GPIO_WritePin(ENABLE_4G_GPIO_Port, ENABLE_4G_Pin, GPIO_PIN_RESET);
	HAL_Delay(1);
	HAL_GPIO_WritePin(ENABLE_4G_GPIO_Port, ENABLE_4G_Pin, GPIO_PIN_SET);

	//A0
	HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_RESET);
	HAL_Delay(1);
	HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_SET);
}

void print_atCommand(uint8_t rx_msg[], uint8_t onOff)
{
	int i;
	if(onOff == 1)
	{
		aewin_dbg("\r\n=====AT command=====\r\n");
		for(i=0;i<UART2_RX_LENGTH;i++)
		{
			aewin_dbg("%c",rx_msg[i]);
		}
		aewin_dbg("---------------------\r\n");
	}
}

uint8_t check_lowPower(uint32_t adc_value)
{
	uint8_t low_std = 9*10 + current_IgEvent[NUM_12V_shutdown]*5;
	uint8_t current_voltage = (adc_voltageConversion_int(adc_value)*10 + (adc_voltageConversion_float(adc_value)/10) );

	if( current_voltage < low_std)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}

uint8_t check_highPower(uint32_t adc_value)
{
	uint8_t high_std = 10*10 + current_IgEvent[NUM_12V_startup]*5;
	uint8_t current_voltage = (adc_voltageConversion_int(adc_value)*10 + (adc_voltageConversion_float(adc_value)/10) );

	if( current_voltage > high_std)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}

void config_recovery(void)
{
	uint8_t data_index;

	#if 1
	for(data_index = 0; data_index<NUM_total;data_index++)
	{
		current_IgEvent[data_index] = flash_IgEvent[data_index];
	}
	#endif

	# if 0
	current_IgEvent[0] = SPI_FLASH_PROGRAM_PAGE;
	current_IgEvent[1] = SPI_FLASH_ADD_Byte0;
	current_IgEvent[2] = SPI_FLASH_ADD_Byte1;
	current_IgEvent[3] = SPI_FLASH_ADD_Byte2;
	current_IgEvent[4] = SPI_FLASH_DATA_TAG;
	for(data_index = SPI_FLASH_LEN_CMDADD + 1; data_index<NUM_total;data_index++)
	{
		current_IgEvent[data_index] = eeprom_test[data_index - SPI_FLASH_LEN_CMDADD];
	}
	#endif
}


void write_setting_to_eeprom(void){
	uint32_t Address = 0;
	uint8_t data_counter = 0;

	Address = FLASH_USER_START_ADDR;

	/* Flash page erase */
	EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
	EraseInitStruct.PageAddress = FLASH_USER_START_ADDR;
	EraseInitStruct.NbPages     = (FLASH_USER_END_ADDR - FLASH_USER_START_ADDR)/FLASH_PAGE_SIZE;

	if (HAL_FLASHEx_Erase(&EraseInitStruct, &PageError) != HAL_OK)
	{
	  /*
		Error occurred while page erase.
		User can add here some code to deal with this error.
		PageError will contain the faulty page and then to know the code error on this page,
		user can call function 'HAL_FLASH_GetError()'
	  */
	}

	/*Flash write current data */
	// write EEPROM_TAG
	if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_HALFWORD, Address, EEPROM_TAG) != HAL_OK)
	{
	/* Error occurred while writing data in Flash memory.
	   User can add here some code to deal with this error */
	}

	for(data_counter = 1; data_counter < EEPROM_DATA_LEN ; data_counter++)
	{
		if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_HALFWORD, Address + data_counter*EEPROM_DATA_SIZE, current_IgEvent[data_counter + SPI_FLASH_LEN_CMDADD]) != HAL_OK)
		{
		/* Error occurred while writing data in Flash memory.
		   User can add here some code to deal with this error */
		}
	}

